app/views/races/info.html.erb

SELECT "pilots".* FROM "pilots" WHERE (id in (
---
              <tbody>
              <% @data[:pilots].each do |item| %>